{
  "prophet-adam": {
    "en": [
      { "slide": 0, "title": "A Special Creation", "script": "Before there were any people on Earth, Allah decided to create something very special. Allah told the angels: I am going to create a human being from clay. Allah created Adam from different types of clay from all over the Earth. That's why people today have different skin colors - beautiful shades of brown, tan, and more!" },
      { "slide": 1, "title": "The Gift of Life", "script": "After shaping Adam's body from clay, Allah blew the soul into him. Suddenly, Adam opened his eyes! He could see, hear, think, and feel. SubhanAllah! The very first thing Adam said was Alhamdulillah - praising Allah!" },
      { "slide": 2, "title": "The Angels Bow Down", "script": "Allah commanded all the angels to bow down to Adam as a sign of respect. All the angels obeyed Allah and prostrated to Adam right away! This showed how special humans are to Allah." },
      { "slide": 3, "title": "One Who Refused", "script": "But there was one who did not bow - Iblis, also known as Shaytan. He was proud and arrogant. I am better than him! he said. You made me from fire and him from clay! Pride and arrogance are very bad. We should always be humble." },
      { "slide": 4, "title": "Adam Learns Names", "script": "Allah taught Adam the names of everything - animals, plants, objects, and more! When Allah asked the angels about these names, they didn't know. But Adam knew them all! This showed that Allah gave humans special knowledge." },
      { "slide": 5, "title": "A Companion for Adam", "script": "Allah created Hawa, also known as Eve, as a companion for Adam. They lived happily together in Jannah, which means Paradise. It was a beautiful garden with flowers everywhere, delicious fruits, rivers of pure water, friendly animals, and perfect weather always!" },
      { "slide": 6, "title": "One Rule", "script": "Allah told Adam and Hawa they could enjoy everything in Jannah, but there was ONE tree they should not go near. Do not approach this tree, Allah said. This rule was to test their obedience to Allah." },
      { "slide": 7, "title": "A Mistake", "script": "Shaytan whispered to Adam and Hawa and tricked them. They ate from the forbidden tree. As soon as they did, they realized they had made a big mistake! Shaytan is always trying to trick us. We must be careful and say A'udhu billahi min ash-shaytan ir-rajim to seek protection from him." },
      { "slide": 8, "title": "Asking for Forgiveness", "script": "Adam and Hawa felt very sorry. They turned to Allah and said: Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy on us, we will surely be among the losers. And SubhanAllah - Allah forgave them! Allah is the Most Merciful!" },
      { "slide": 9, "title": "A New Home on Earth", "script": "Adam and Hawa were sent to live on Earth. Allah told them that Earth would be their home, and from them would come all the people of the world - including you! We are all one big family, descendants of Adam and Hawa." },
      { "slide": 10, "title": "What We Learn", "script": "Let's remember what we learned from Prophet Adam. First, Allah created all humans, so we are all one family! Second, don't be proud like Iblis - always be humble. Third, when we make mistakes, we should ask Allah for forgiveness. And fourth, Allah is the Most Merciful and loves to forgive us." },
      { "slide": 11, "title": "Adam's Dua", "script": "Here is Adam's beautiful dua for forgiveness. In Arabic it is: Rabbana zalamna anfusana wa in lam taghfir lana wa tarhamna lanakoonanna minal khasireen. This means: Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers. You can say this dua whenever you make a mistake and want Allah's forgiveness!" },
      { "slide": 12, "title": "Quiz Time", "script": "Wow! You've completed the story of Prophet Adam! Now it's time for a fun quiz to see how much you remember. Answer these questions to earn bonus stars! Good luck!" },
      { "slide": 13, "title": "Question One", "script": "Question one: What was Adam created from? Was it Light, Clay, Fire, or Water? Take your time and choose the correct answer!" },
      { "slide": 14, "title": "Question Two", "script": "Question two: Who refused to bow to Adam? Was it the angels, Hawa, Iblis who is also called Shaytan, or the animals?" },
      { "slide": 15, "title": "Question Three", "script": "Question three: What happened when Adam asked Allah for forgiveness? Did Allah become angry, did Allah forgive him, did nothing happen, or did Adam have to wait?" },
      { "slide": 16, "title": "Amazing Job", "script": "Amazing job! You did wonderfully! You've learned so much about Prophet Adam today. Remember, when you make a mistake, say sorry to Allah - He loves to forgive! Keep earning stars and learning more stories!" },
      { "slide": 17, "title": "Bonus Video", "script": "Congratulations! You've unlocked a bonus video! Watch this beautiful animated story about Prophet Adam to see everything we learned come to life!" }
    ],
    "ar": [
      { "slide": 0, "title": "خلق مميز", "script": "قبل أن يكون هناك أي بشر على الأرض، قرر الله أن يخلق شيئاً مميزاً جداً. قال الله للملائكة: إني خالق بشراً من طين. خلق الله آدم من أنواع مختلفة من الطين من جميع أنحاء الأرض. لهذا السبب يملك الناس اليوم ألوان بشرة مختلفة!" },
      { "slide": 1, "title": "نعمة الحياة", "script": "بعد أن شكّل الله جسد آدم من الطين، نفخ فيه الروح. فجأة، فتح آدم عينيه! أصبح يستطيع أن يرى ويسمع ويفكر ويشعر. سبحان الله! أول شيء قاله آدم كان الحمد لله!" },
      { "slide": 2, "title": "الملائكة تسجد", "script": "أمر الله جميع الملائكة بالسجود لآدم تكريماً له. أطاعت جميع الملائكة الله وسجدت لآدم فوراً! هذا يُظهر مدى خصوصية الإنسان عند الله." },
      { "slide": 3, "title": "واحد رفض", "script": "لكن كان هناك واحد لم يسجد - إبليس، المعروف أيضاً بالشيطان. كان متكبراً ومغروراً. قال: أنا خير منه! خلقتني من نار وخلقته من طين! الكبر والغرور سيئان جداً. يجب أن نكون متواضعين دائماً." },
      { "slide": 4, "title": "آدم يتعلم الأسماء", "script": "علّم الله آدم أسماء كل شيء - الحيوانات والنباتات والأشياء وغيرها! عندما سأل الله الملائكة عن هذه الأسماء، لم يعرفوها. لكن آدم عرفها كلها! هذا يُظهر أن الله أعطى الإنسان علماً خاصاً." },
      { "slide": 5, "title": "رفيقة لآدم", "script": "خلق الله حواء لتكون رفيقة لآدم. عاشا معاً بسعادة في الجنة. كانت حديقة جميلة فيها زهور في كل مكان، وفواكه لذيذة، وأنهار من الماء النقي، وحيوانات ودودة، وطقس مثالي دائماً!" },
      { "slide": 6, "title": "قاعدة واحدة", "script": "أخبر الله آدم وحواء أنهما يستطيعان الاستمتاع بكل شيء في الجنة، لكن كانت هناك شجرة واحدة يجب ألا يقتربا منها. قال الله: ولا تقربا هذه الشجرة. كانت هذه القاعدة لاختبار طاعتهما لله." },
      { "slide": 7, "title": "خطأ", "script": "وسوس الشيطان لآدم وحواء وخدعهما. أكلا من الشجرة المحرمة. بمجرد أن فعلا ذلك، أدركا أنهما ارتكبا خطأً كبيراً! الشيطان يحاول دائماً خداعنا. يجب أن نكون حذرين ونقول أعوذ بالله من الشيطان الرجيم." },
      { "slide": 8, "title": "طلب المغفرة", "script": "شعر آدم وحواء بالندم الشديد. توجها إلى الله وقالا: ربنا ظلمنا أنفسنا وإن لم تغفر لنا وترحمنا لنكونن من الخاسرين. وسبحان الله - غفر الله لهما! الله أرحم الراحمين!" },
      { "slide": 9, "title": "منزل جديد على الأرض", "script": "أُرسل آدم وحواء للعيش على الأرض. أخبرهما الله أن الأرض ستكون موطنهما، ومنهما سيأتي جميع البشر في العالم - بما فيهم أنت! نحن جميعاً عائلة كبيرة واحدة، أحفاد آدم وحواء." },
      { "slide": 10, "title": "ما نتعلمه", "script": "دعونا نتذكر ما تعلمناه من النبي آدم. أولاً، خلق الله جميع البشر، فنحن جميعاً عائلة واحدة! ثانياً، لا تكن متكبراً مثل إبليس - كن متواضعاً دائماً. ثالثاً، عندما نخطئ، يجب أن نستغفر الله. ورابعاً، الله أرحم الراحمين ويحب أن يغفر لنا." },
      { "slide": 11, "title": "دعاء آدم", "script": "إليكم دعاء آدم الجميل للمغفرة: ربنا ظلمنا أنفسنا وإن لم تغفر لنا وترحمنا لنكونن من الخاسرين. يمكنك قول هذا الدعاء كلما أخطأت وأردت مغفرة الله!" },
      { "slide": 12, "title": "وقت الاختبار", "script": "رائع! لقد أكملت قصة النبي آدم! الآن حان وقت اختبار ممتع لنرى كم تتذكر. أجب على هذه الأسئلة لتكسب نجوماً إضافية! حظاً سعيداً!" },
      { "slide": 13, "title": "السؤال الأول", "script": "السؤال الأول: من ماذا خُلق آدم؟ هل كان من النور، أو الطين، أو النار، أو الماء؟ خذ وقتك واختر الإجابة الصحيحة!" },
      { "slide": 14, "title": "السؤال الثاني", "script": "السؤال الثاني: من رفض السجود لآدم؟ هل كانت الملائكة، أو حواء، أو إبليس الذي يُسمى أيضاً الشيطان، أو الحيوانات؟" },
      { "slide": 15, "title": "السؤال الثالث", "script": "السؤال الثالث: ماذا حدث عندما استغفر آدم الله؟ هل غضب الله، أو غفر الله له، أو لم يحدث شيء، أو كان على آدم الانتظار؟" },
      { "slide": 16, "title": "عمل رائع", "script": "عمل رائع! لقد أبدعت! تعلمت الكثير عن النبي آدم اليوم. تذكر، عندما تخطئ، استغفر الله - فهو يحب أن يغفر! استمر في كسب النجوم وتعلم المزيد من القصص!" },
      { "slide": 17, "title": "فيديو إضافي", "script": "تهانينا! لقد فتحت فيديو إضافي! شاهد هذه القصة المتحركة الجميلة عن النبي آدم لترى كل ما تعلمناه يتحول إلى حياة!" }
    ]
  },
  "prophet-ibrahim": {
    "en": [
      { "slide": 0, "title": "A Special Baby", "script": "Long ago, a special baby was born. His name was Ibrahim. Even as a child, Ibrahim was very smart and always wondered about the world around him. Ibrahim is known as Khalilullah - the Friend of Allah! He is one of the greatest prophets." },
      { "slide": 1, "title": "Looking at the Sky", "script": "One night, young Ibrahim looked up at the beautiful stars. Are these my lord? he wondered. But when the stars disappeared at dawn, he knew they couldn't be. Ibrahim kept searching for the truth." },
      { "slide": 2, "title": "The Beautiful Moon", "script": "Then Ibrahim saw the moon, big and bright! This is my lord! he said. But when morning came, the moon also disappeared. Ibrahim was still searching for the One True God." },
      { "slide": 3, "title": "The Mighty Sun", "script": "When the sun rose, Ibrahim thought, This must be my lord - it's the biggest! But when evening came, even the powerful sun went away. Ibrahim understood that only Allah - who created the stars, moon, and sun - deserves to be worshipped!" },
      { "slide": 4, "title": "The Stone Statues", "script": "Ibrahim's people worshipped statues made of stone. Ibrahim knew this was wrong. How can you worship things that can't hear, see, or help you? he asked them. We should only worship Allah!" },
      { "slide": 5, "title": "The Great Fire", "script": "The angry people built a huge fire and threw Ibrahim into it! But Ibrahim stayed calm. He trusted Allah completely. He said: Allah is sufficient for me." },
      { "slide": 6, "title": "Allah's Amazing Miracle", "script": "Allah commanded: O fire, be cool and safe for Ibrahim! The fire became cool like a garden! Ibrahim walked out completely safe. SubhanAllah! This shows that Allah protects those who trust Him." },
      { "slide": 7, "title": "Building Allah's House", "script": "Years later, Allah told Ibrahim and his son Ismail to build the Kaaba - the first house of worship for Allah. They worked together, brick by brick, making dua as they built." },
      { "slide": 8, "title": "What We Learn", "script": "Let's remember what we learned from Prophet Ibrahim. Always search for the truth. Trust Allah even when things are hard. Be brave and stand up for what's right. Only worship Allah alone." },
      { "slide": 9, "title": "Ibrahim's Dua", "script": "Here is the beautiful dua Ibrahim and Ismail made while building the Kaaba: Rabbana taqabbal minna innaka antas samee ul aleem. This means: Our Lord, accept from us. Indeed You are the Hearing, the Knowing." },
      { "slide": 10, "title": "Quiz Time", "script": "Amazing! You've completed the story of Prophet Ibrahim! Now let's see how much you remember with a fun quiz. Answer these questions to earn bonus stars!" },
      { "slide": 11, "title": "Question One", "script": "Question one: What did Ibrahim realize about the stars, moon, and sun? Were they very beautiful, created by Allah and disappear, give us light, or very far away?" },
      { "slide": 12, "title": "Question Two", "script": "Question two: What happened when Ibrahim was thrown into the fire? Did he get burned, run away, or did Allah make the fire cool and safe?" },
      { "slide": 13, "title": "Question Three", "script": "Question three: What did Ibrahim and Ismail build together? Was it a house, the Kaaba, a boat, or a well?" },
      { "slide": 14, "title": "Amazing Job", "script": "Amazing job! You did wonderfully! Remember, trust in Allah and He will never let you down! Keep earning stars and learning more stories!" },
      { "slide": 15, "title": "Bonus Video", "script": "Congratulations! You've unlocked a bonus video! Watch this beautiful animated story about Prophet Ibrahim!" }
    ],
    "ar": [
      { "slide": 0, "title": "طفل مميز", "script": "منذ زمن بعيد، وُلد طفل مميز. اسمه إبراهيم. حتى وهو طفل، كان إبراهيم ذكياً جداً ودائماً يتساءل عن العالم من حوله. إبراهيم معروف بخليل الله! وهو من أعظم الأنبياء." },
      { "slide": 1, "title": "النظر إلى السماء", "script": "ذات ليلة، نظر إبراهيم الصغير إلى النجوم الجميلة. هل هذه ربي؟ تساءل. لكن عندما اختفت النجوم عند الفجر، عرف أنها لا يمكن أن تكون. استمر إبراهيم في البحث عن الحقيقة." },
      { "slide": 2, "title": "القمر الجميل", "script": "ثم رأى إبراهيم القمر، كبيراً ومشرقاً! هذا ربي! قال. لكن عندما جاء الصباح، اختفى القمر أيضاً. كان إبراهيم لا يزال يبحث عن الإله الحقيقي." },
      { "slide": 3, "title": "الشمس العظيمة", "script": "عندما طلعت الشمس، فكر إبراهيم: هذا يجب أن يكون ربي - إنها الأكبر! لكن عندما جاء المساء، ذهبت حتى الشمس القوية. فهم إبراهيم أن الله وحده - الذي خلق النجوم والقمر والشمس - يستحق العبادة!" },
      { "slide": 4, "title": "التماثيل الحجرية", "script": "كان قوم إبراهيم يعبدون تماثيل من حجر. عرف إبراهيم أن هذا خطأ. كيف تعبدون أشياء لا تسمع ولا ترى ولا تنفعكم؟ سألهم. يجب أن نعبد الله وحده!" },
      { "slide": 5, "title": "النار العظيمة", "script": "بنى الناس الغاضبون ناراً ضخمة وألقوا إبراهيم فيها! لكن إبراهيم بقي هادئاً. وثق بالله تماماً. قال: حسبي الله." },
      { "slide": 6, "title": "معجزة الله المذهلة", "script": "أمر الله: يا نار كوني برداً وسلاماً على إبراهيم! أصبحت النار باردة مثل الحديقة! خرج إبراهيم سالماً تماماً. سبحان الله! هذا يُظهر أن الله يحمي من يثقون به." },
      { "slide": 7, "title": "بناء بيت الله", "script": "بعد سنوات، أمر الله إبراهيم وابنه إسماعيل ببناء الكعبة - أول بيت عبادة لله. عملا معاً، لبنة بلبنة، يدعوان وهما يبنيان." },
      { "slide": 8, "title": "ما نتعلمه", "script": "دعونا نتذكر ما تعلمناه من النبي إبراهيم. ابحث دائماً عن الحقيقة. ثق بالله حتى عندما تكون الأمور صعبة. كن شجاعاً ودافع عن الحق. اعبد الله وحده." },
      { "slide": 9, "title": "دعاء إبراهيم", "script": "هذا هو الدعاء الجميل الذي دعا به إبراهيم وإسماعيل أثناء بناء الكعبة: ربنا تقبل منا إنك أنت السميع العليم." },
      { "slide": 10, "title": "وقت الاختبار", "script": "رائع! لقد أكملت قصة النبي إبراهيم! الآن لنرى كم تتذكر باختبار ممتع. أجب على هذه الأسئلة لتكسب نجوماً إضافية!" },
      { "slide": 11, "title": "السؤال الأول", "script": "السؤال الأول: ماذا أدرك إبراهيم عن النجوم والقمر والشمس؟ هل هي جميلة جداً، أو مخلوقة من الله وتختفي، أو تعطينا نوراً، أو بعيدة جداً؟" },
      { "slide": 12, "title": "السؤال الثاني", "script": "السؤال الثاني: ماذا حدث عندما أُلقي إبراهيم في النار؟ هل احترق، أو هرب، أو جعل الله النار برداً وسلاماً؟" },
      { "slide": 13, "title": "السؤال الثالث", "script": "السؤال الثالث: ماذا بنى إبراهيم وإسماعيل معاً؟ هل كان بيتاً، أو الكعبة، أو قارباً، أو بئراً؟" },
      { "slide": 14, "title": "عمل رائع", "script": "عمل رائع! لقد أبدعت! تذكر، ثق بالله ولن يخذلك أبداً! استمر في كسب النجوم وتعلم المزيد من القصص!" },
      { "slide": 15, "title": "فيديو إضافي", "script": "تهانينا! لقد فتحت فيديو إضافي! شاهد هذه القصة المتحركة الجميلة عن النبي إبراهيم!" }
    ]
  },
  "prophet-nuh": {
    "en": [
      { "slide": 0, "title": "The Faithful Prophet", "script": "Long, long ago, there lived a very special man named Prophet Nuh, peace be upon him. He loved Allah very much and always tried to do good things. Allah chose him to be a prophet and teach people about being kind and worshipping only Allah." },
      { "slide": 1, "title": "The Important Message", "script": "Prophet Nuh went to his people every day to share Allah's message. Please believe in Allah, he would say kindly. He is the One who created everything - the stars, the moon, the animals, and you! But sadly, most people didn't want to listen." },
      { "slide": 2, "title": "Never Giving Up", "script": "Prophet Nuh didn't give up! For 950 years - that's longer than anyone alive today - he kept inviting people to believe in Allah. Day and night, in good weather and bad, he patiently shared his message. Can you imagine being that patient?" },
      { "slide": 3, "title": "Quick Question", "script": "Quick question! How many years did Prophet Nuh call people to believe in Allah? Was it 100 years, 500 years, 950 years, or 50 years? Think carefully!" },
      { "slide": 4, "title": "Building the Ark", "script": "Allah told Prophet Nuh to build a huge boat called an Ark. Even though they were far from the ocean, Prophet Nuh trusted Allah completely. He worked hard every day, cutting wood and building the boat exactly as Allah instructed." },
      { "slide": 5, "title": "The Animals Board", "script": "When the Ark was ready, Allah told Prophet Nuh to bring a pair of every animal onto the boat - two elephants, two lions, two birds, two of everything! Imagine all those animals walking onto the big boat together. What a sight!" },
      { "slide": 6, "title": "The Great Flood", "script": "Then the rain began to fall - more rain than anyone had ever seen! Water came from the sky and from the ground. The whole earth was covered with water. But Prophet Nuh, the believers, and all the animals were safe inside the Ark, floating on the waves." },
      { "slide": 7, "title": "A New Beginning", "script": "After many days, the rain stopped and the water went away. Prophet Nuh sent a dove to find land, and it came back with an olive leaf! The Ark landed safely on a mountain called Judi. Prophet Nuh thanked Allah for keeping them safe." },
      { "slide": 8, "title": "What We Learn", "script": "What do we learn from Prophet Nuh? Always trust in Allah, even when things seem impossible. Be patient and never give up doing good. Listen to Allah's guidance and follow it. Be kind to all of Allah's creatures." },
      { "slide": 9, "title": "Nuh's Dua", "script": "Here is a beautiful dua Prophet Nuh made: Rabbi ighfir li wa li walidayya. This means: My Lord, forgive me and my parents. We can say this dua too!" },
      { "slide": 10, "title": "Quiz Time", "script": "Story complete! Time for a quiz! Answer these questions to unlock your bonus video!" },
      { "slide": 11, "title": "Question One", "script": "Question one: What did Allah tell Prophet Nuh to build? A house, an Ark which is a boat, a mosque, or a castle?" },
      { "slide": 12, "title": "Question Two", "script": "Question two: What animals did Prophet Nuh bring on the Ark? Only birds, only big animals, a pair of every animal, or no animals?" },
      { "slide": 13, "title": "Question Three", "script": "Question three: What is the main lesson from Prophet Nuh's story? Build boats every day, trust in Allah and be patient, collect animals, or wait for rain?" },
      { "slide": 14, "title": "Congratulations", "script": "Congratulations! You did amazing! Remember, trust Allah and never give up, even when things are hard!" },
      { "slide": 15, "title": "Bonus Video", "script": "You've unlocked a bonus video! Watch this beautiful animation about Prophet Nuh and the great Ark!" }
    ],
    "ar": [
      { "slide": 0, "title": "النبي المؤمن", "script": "منذ زمن بعيد جداً، عاش رجل مميز جداً اسمه النبي نوح عليه السلام. كان يحب الله كثيراً ودائماً يحاول فعل الخير. اختاره الله ليكون نبياً ويعلم الناس اللطف وعبادة الله وحده." },
      { "slide": 1, "title": "الرسالة المهمة", "script": "ذهب النبي نوح إلى قومه كل يوم ليشاركهم رسالة الله. آمنوا بالله، كان يقول بلطف. هو الذي خلق كل شيء - النجوم والقمر والحيوانات وأنتم! لكن للأسف، معظم الناس لم يريدوا الاستماع." },
      { "slide": 2, "title": "لم يستسلم أبداً", "script": "لم يستسلم النبي نوح! لمدة 950 سنة - وهي أطول من عمر أي شخص حي اليوم - استمر في دعوة الناس للإيمان بالله. ليلاً ونهاراً، في الطقس الجيد والسيء، شارك رسالته بصبر. هل يمكنك تخيل هذا الصبر؟" },
      { "slide": 3, "title": "سؤال سريع", "script": "سؤال سريع! كم سنة دعا النبي نوح الناس للإيمان بالله؟ هل كانت 100 سنة، أو 500 سنة، أو 950 سنة، أو 50 سنة؟ فكر جيداً!" },
      { "slide": 4, "title": "بناء السفينة", "script": "أمر الله النبي نوح ببناء قارب ضخم يسمى السفينة. رغم أنهم كانوا بعيدين عن المحيط، وثق النبي نوح بالله تماماً. عمل بجد كل يوم، يقطع الخشب ويبني السفينة كما أمره الله." },
      { "slide": 5, "title": "الحيوانات تصعد", "script": "عندما كانت السفينة جاهزة، أمر الله النبي نوح بإحضار زوج من كل حيوان على السفينة - فيلان، أسدان، طائران، اثنان من كل شيء! تخيل كل تلك الحيوانات تمشي إلى السفينة الكبيرة معاً. يا له من منظر!" },
      { "slide": 6, "title": "الطوفان العظيم", "script": "ثم بدأ المطر يهطل - مطر أكثر مما رآه أي شخص! جاء الماء من السماء ومن الأرض. غطى الماء الأرض كلها. لكن النبي نوح والمؤمنين وجميع الحيوانات كانوا آمنين داخل السفينة، يطفون على الأمواج." },
      { "slide": 7, "title": "بداية جديدة", "script": "بعد أيام كثيرة، توقف المطر وذهب الماء. أرسل النبي نوح حمامة للبحث عن أرض، وعادت بورقة زيتون! رست السفينة بأمان على جبل يسمى الجودي. شكر النبي نوح الله على حفظهم آمنين." },
      { "slide": 8, "title": "ما نتعلمه", "script": "ماذا نتعلم من النبي نوح؟ ثق دائماً بالله، حتى عندما تبدو الأمور مستحيلة. كن صبوراً ولا تستسلم عن فعل الخير. استمع لهداية الله واتبعها. كن لطيفاً مع جميع مخلوقات الله." },
      { "slide": 9, "title": "دعاء نوح", "script": "هذا دعاء جميل دعا به النبي نوح: رب اغفر لي ولوالدي. يمكننا أن نقول هذا الدعاء نحن أيضاً!" },
      { "slide": 10, "title": "وقت الاختبار", "script": "اكتملت القصة! حان وقت الاختبار! أجب على هذه الأسئلة لفتح الفيديو الإضافي!" },
      { "slide": 11, "title": "السؤال الأول", "script": "السؤال الأول: ماذا أمر الله النبي نوح أن يبني؟ بيتاً، أو سفينة، أو مسجداً، أو قلعة؟" },
      { "slide": 12, "title": "السؤال الثاني", "script": "السؤال الثاني: ما الحيوانات التي أحضرها النبي نوح على السفينة؟ الطيور فقط، أو الحيوانات الكبيرة فقط، أو زوج من كل حيوان، أو لا حيوانات؟" },
      { "slide": 13, "title": "السؤال الثالث", "script": "السؤال الثالث: ما الدرس الرئيسي من قصة النبي نوح؟ بناء القوارب كل يوم، أو الثقة بالله والصبر، أو جمع الحيوانات، أو انتظار المطر؟" },
      { "slide": 14, "title": "تهانينا", "script": "تهانينا! لقد أبدعت! تذكر، ثق بالله ولا تستسلم أبداً، حتى عندما تكون الأمور صعبة!" },
      { "slide": 15, "title": "فيديو إضافي", "script": "لقد فتحت فيديو إضافي! شاهد هذه الرسوم المتحركة الجميلة عن النبي نوح والسفينة العظيمة!" }
    ]
  },
  "prophet-yusuf": {
    "en": [
      { "slide": 0, "title": "The Amazing Dream", "script": "Prophet Yusuf, peace be upon him, was a young boy who had an amazing dream! In his dream, he saw eleven stars, the sun, and the moon all bowing down to him. He was so excited that he ran to tell his father, Prophet Yaqub." },
      { "slide": 1, "title": "A Father's Advice", "script": "My dear son, said Prophet Yaqub with a gentle smile, Allah has given you a special gift! But don't tell your brothers about this dream. They might feel jealous. Yusuf listened carefully to his wise father." },
      { "slide": 2, "title": "The Jealous Brothers", "script": "Yusuf had eleven brothers, and some of them were jealous because their father loved Yusuf very much. They made a bad plan. They took Yusuf on a trip and left him in a deep, dark well. Poor Yusuf was all alone!" },
      { "slide": 3, "title": "Quick Question", "script": "Quick question! What did Yusuf see in his dream? Animals in a garden, stars sun and moon bowing to him, a beautiful palace, or a big river? Think carefully!" },
      { "slide": 4, "title": "A New Journey", "script": "But Allah was always with Yusuf! Some travelers found him in the well and took him to Egypt. Even though he was far from home, Yusuf never forgot Allah. He prayed and trusted that Allah had a plan for him." },
      { "slide": 5, "title": "Life in Egypt", "script": "In Egypt, Yusuf grew up to be very handsome and wise. He always told the truth and was kind to everyone. But some people were mean to him, and he was put in prison even though he did nothing wrong!" },
      { "slide": 6, "title": "The King's Dream", "script": "One day, the King of Egypt had a strange dream that no one could explain. But Yusuf, with Allah's help, knew exactly what it meant! He told the King that there would be seven good years with lots of food, then seven hard years with very little." },
      { "slide": 7, "title": "Yusuf Becomes a Leader", "script": "The King was so impressed that he made Yusuf an important leader in Egypt! Yusuf saved food during the good years so people wouldn't go hungry during the hard years. He was kind and fair to everyone." },
      { "slide": 8, "title": "The Happy Reunion", "script": "Years later, Yusuf's brothers came to Egypt looking for food. They didn't recognize Yusuf, but he knew them! Instead of being angry, Yusuf forgave them with all his heart. His whole family came to live in Egypt, and his dream came true - they all bowed to him with respect and love!" },
      { "slide": 9, "title": "What We Learn", "script": "What do we learn from Prophet Yusuf? Always forgive others, even when they hurt you. Trust Allah's plan, even in difficult times. Be patient - good things come to those who wait. Always tell the truth and be kind. Allah never forgets those who believe in Him." },
      { "slide": 10, "title": "Yusuf's Dua", "script": "Prophet Yusuf thanked Allah for all His blessings. He said: Rabbi qad ataytani minal mulk. This means: My Lord, You have given me authority. We should always be grateful to Allah too!" },
      { "slide": 11, "title": "Quiz Time", "script": "Story complete! Time for a quiz! Answer these questions to unlock your bonus video!" },
      { "slide": 12, "title": "Question One", "script": "Question one: Where did Yusuf's brothers leave him? At home, in a well, on a mountain, or in a forest?" },
      { "slide": 13, "title": "Question Two", "script": "Question two: What special ability did Allah give Yusuf? Flying, understanding dreams, speaking to animals, or super strength?" },
      { "slide": 14, "title": "Question Three", "script": "Question three: What did Yusuf do when he met his brothers again? Was he angry at them, sent them away, forgave them, or didn't talk to them?" },
      { "slide": 15, "title": "Congratulations", "script": "Congratulations! You did amazing! Remember, forgiveness is beautiful. Always forgive others like Prophet Yusuf did!" },
      { "slide": 16, "title": "Bonus Video", "script": "You've unlocked a bonus video! Watch this beautiful animation about Prophet Yusuf and his incredible journey!" }
    ],
    "ar": [
      { "slide": 0, "title": "الحلم المذهل", "script": "النبي يوسف عليه السلام كان صبياً صغيراً رأى حلماً مذهلاً! في حلمه، رأى أحد عشر كوكباً والشمس والقمر كلهم يسجدون له. كان متحمساً جداً فركض ليخبر أباه النبي يعقوب." },
      { "slide": 1, "title": "نصيحة الأب", "script": "يا بني، قال النبي يعقوب بابتسامة لطيفة، لقد أعطاك الله هدية خاصة! لكن لا تخبر إخوتك عن هذا الحلم. قد يشعرون بالغيرة. استمع يوسف بعناية لأبيه الحكيم." },
      { "slide": 2, "title": "الإخوة الغيورون", "script": "كان ليوسف أحد عشر أخاً، وبعضهم كانوا غيورين لأن أباهم أحب يوسف كثيراً. وضعوا خطة سيئة. أخذوا يوسف في رحلة وتركوه في بئر عميقة مظلمة. كان يوسف المسكين وحيداً!" },
      { "slide": 3, "title": "سؤال سريع", "script": "سؤال سريع! ماذا رأى يوسف في حلمه؟ حيوانات في حديقة، أو نجوم وشمس وقمر يسجدون له، أو قصر جميل، أو نهر كبير؟ فكر جيداً!" },
      { "slide": 4, "title": "رحلة جديدة", "script": "لكن الله كان دائماً مع يوسف! وجده بعض المسافرين في البئر وأخذوه إلى مصر. رغم أنه كان بعيداً عن بيته، لم ينس يوسف الله أبداً. صلى ووثق أن لله خطة له." },
      { "slide": 5, "title": "الحياة في مصر", "script": "في مصر، كبر يوسف ليصبح وسيماً وحكيماً جداً. كان دائماً يقول الحقيقة ولطيفاً مع الجميع. لكن بعض الناس كانوا سيئين معه، ووُضع في السجن رغم أنه لم يفعل شيئاً خاطئاً!" },
      { "slide": 6, "title": "حلم الملك", "script": "ذات يوم، رأى ملك مصر حلماً غريباً لم يستطع أحد تفسيره. لكن يوسف، بمساعدة الله، عرف بالضبط ما يعنيه! أخبر الملك أنه ستكون هناك سبع سنوات جيدة بطعام كثير، ثم سبع سنوات صعبة بقليل جداً." },
      { "slide": 7, "title": "يوسف يصبح قائداً", "script": "أُعجب الملك كثيراً فجعل يوسف قائداً مهماً في مصر! حفظ يوسف الطعام خلال السنوات الجيدة حتى لا يجوع الناس خلال السنوات الصعبة. كان لطيفاً وعادلاً مع الجميع." },
      { "slide": 8, "title": "لمّ الشمل السعيد", "script": "بعد سنوات، جاء إخوة يوسف إلى مصر يبحثون عن طعام. لم يتعرفوا على يوسف، لكنه عرفهم! بدلاً من أن يغضب، سامحهم يوسف بكل قلبه. جاءت عائلته كلها لتعيش في مصر، وتحقق حلمه - سجدوا له جميعاً باحترام وحب!" },
      { "slide": 9, "title": "ما نتعلمه", "script": "ماذا نتعلم من النبي يوسف؟ سامح الآخرين دائماً، حتى عندما يؤذونك. ثق بخطة الله، حتى في الأوقات الصعبة. كن صبوراً - الأشياء الجيدة تأتي لمن ينتظر. قل الحقيقة دائماً وكن لطيفاً. الله لا ينسى من يؤمنون به." },
      { "slide": 10, "title": "دعاء يوسف", "script": "شكر النبي يوسف الله على كل نعمه. قال: رب قد آتيتني من الملك. يجب أن نكون شاكرين لله دائماً!" },
      { "slide": 11, "title": "وقت الاختبار", "script": "اكتملت القصة! حان وقت الاختبار! أجب على هذه الأسئلة لفتح الفيديو الإضافي!" },
      { "slide": 12, "title": "السؤال الأول", "script": "السؤال الأول: أين ترك إخوة يوسف أخاهم؟ في البيت، أو في بئر، أو على جبل، أو في غابة؟" },
      { "slide": 13, "title": "السؤال الثاني", "script": "السؤال الثاني: ما القدرة الخاصة التي أعطاها الله ليوسف؟ الطيران، أو فهم الأحلام، أو التحدث مع الحيوانات، أو القوة الخارقة؟" },
      { "slide": 14, "title": "السؤال الثالث", "script": "السؤال الثالث: ماذا فعل يوسف عندما التقى إخوته مرة أخرى؟ هل غضب منهم، أو أبعدهم، أو سامحهم، أو لم يتحدث معهم؟" },
      { "slide": 15, "title": "تهانينا", "script": "تهانينا! لقد أبدعت! تذكر، المسامحة جميلة. سامح الآخرين دائماً مثل النبي يوسف!" },
      { "slide": 16, "title": "فيديو إضافي", "script": "لقد فتحت فيديو إضافي! شاهد هذه الرسوم المتحركة الجميلة عن النبي يوسف ورحلته المذهلة!" }
    ]
  }
}
